/**
*******************************************************************************
***    명칭: modalIrForm.js
***    설명: 운영관리-IR지원현황 화면
***
*** -----------------------------    Modified Log   ---------------------------
***    버전        수정일자        수정자        내용
*** ---------------------------------------------------------------------------
***    1.0      2023.06.08      LHB      First Coding.
*******************************************************************************
**/
$(function() {

    //========================================================//
    // 화면 스크립트 내에 사용할 객체,상수 정의
    //--------------------------------------------------------//
    var P_RFORM			= $('#registForm');			// 등록폼 객체
    var P_MODE			= $('#mode'      ).val();	// 처리 모드

	var P_TYPE_BTN		= $('.type > a');			// 참여 투자자/경영체 탭 버튼

	//========================================================//
    // 목록 GRID 정의 (EasyUI datagrid)
    //--------------------------------------------------------//

    //========================================================//
    // FORM ELEMENTS 정의
    //--------------------------------------------------------//
    
    //========================================================//
    // 등록폼 VALIDATION RULE 정의
    //--------------------------------------------------------//

	// 탭 전환 클릭 이벤트
    //--------------------------------------------------------//
	function changeTab() {
		var idx = $(this).parent().index();
		P_TYPE_BTN.removeClass('active');
		$(this).addClass('active');
		
		if (idx == 0) {
			// 경영체 정보 탭
			$('#type').val('ENT');
		} else if (idx == 1) {
			// 투자자 정보 탭
			$('#type').val('INVT');
		}
		
		// 해당 투자설명회 재검색
		var row = P_RFORM.serializeObject();
		P_MODAL.doOpenUpdate(row);
	}
	
	// 경영체 정보/투자자 정보 탭 클릭시 이벤트 처리
	P_TYPE_BTN.bind('click', changeTab);
	
	//$('.datepicker-input').datepicker(OPTIONS.DATEPICKER);
	
	// 검색어 입력 엔터 이벤트 처리
	bindEnter($('#srchTextInvt'), $('#btnSearchInvt'));
	
});